For detailed explanation of this examples refer to [pandas iloc[]](https://sparkbyexamples.com/pandas/pandas-iloc-usage-with-examples)

# Pandas Select Columns by  Index

In [1]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark"],
    'Fee' :[20000,25000],
    'Duration':['30days','40days'],
    'Discount':[1000,2300]
              }
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  20000   30days      1000
1  PySpark  25000   40days      2300

In [6]:
#Pandas iloc[] to Select Column by Index or Position
# Selected by column position
df2 = df.iloc[:,[1,2,3]]
df2

     Fee Duration  Discount
0  20000   30days      1000
1  25000   40days      2300

In [7]:
# Select between indexes 1 and 3 (2,3)
df2 = df.iloc[:,1:3]
df2

     Fee Duration
0  20000   30days
1  25000   40days

In [11]:
# Select From 3rd to end
df2 = df.iloc[:,2:]
df2

  Duration  Discount
0   30days      1000
1   40days      2300

In [12]:
# Select First Two Columns
df2 = df.iloc[:,:2]
df2

   Courses    Fee
0    Spark  20000
1  PySpark  25000

In [13]:
# select last column
df2=df.iloc[:,-1:]
df2

   Discount
0      1000
1      2300

In [14]:
# select first column
df2=df.iloc[:,:1]
df2

   Courses
0    Spark
1  PySpark